server/artillery.yml
config:
  target: "http://localhost:3004"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Warm up the application"
    - duration: 120
      arrivalRate: 1
      rampTo: 15
      name: "jump to max load"
    - duration: 120
      arrivalRate: 15
      name: "keep at the max load"
    - duration: 60
      arrivalRate: 15
      rampTo: 1
      name: "calm down"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Eighty"
    weight: 4
    flow:
        - loop:
            - get:
                url: "/reservations/{{ $randomNumber(8000001, 10000000) }}"
          count: 100
  - name: "Twenty"
    weight: 1
    flow:
       - loop:
          - get:
             url: "/reservations/{{ $randomNumber(1, 8000000) }}"
         count: 100